results/stage3-aligned-1gbit-20260715-191158/layout/fio-layout.txt
storage_test: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 128 processes
storage_test: Laying out IO file (1 file / 1024MiB)
storage_test: Laying out IO file (1 file / 1024MiB)
storage_test: Laying out IO file (1 file / 1024MiB)
[...]

storage_test: (groupid=0, jobs=128): err= 0: pid=3824384: Wed Jul 15 20:13:45 2026
  write: IOPS=28, BW=113MiB/s (118MB/s)(128GiB/1161208msec); 0 zone resets
    slat (msec): min=58, max=92854, avg=4266.16, stdev=4322.95
    clat (usec): min=2, max=1128.9M, avg=392453023.92, stdev=207942598.79
     lat (msec): min=60, max=1134.6k, avg=396719.18, stdev=208522.15
    clat percentiles (msec):
     |  1.00th=[ 1821],  5.00th=[17113], 10.00th=[17113], 20.00th=[17113],
     | 30.00th=[17113], 40.00th=[17113], 50.00th=[17113], 60.00th=[17113],
     | 70.00th=[17113], 80.00th=[17113], 90.00th=[17113], 95.00th=[17113],
     | 99.00th=[17113], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=535001, max=1200764, per=100.00%, avg=620415.64, stdev=939.60, samples=15243
   iops        : min=  242, max=  308, avg=269.80, stdev= 0.22, samples=15961
  lat (usec)   : 4=0.02%, 10=0.29%, 20=0.07%, 50=0.01%, 100=0.01%
  lat (msec)   : 100=0.01%, 250=0.03%, 500=0.06%, 750=0.12%, 1000=0.08%
  lat (msec)   : 2000=0.36%, >=2000=98.95%
  cpu          : usr=0.01%, sys=0.79%, ctx=26818724, majf=2, minf=13255174
  IO depths    : 1=0.4%, 2=0.8%, 4=1.6%, 8=3.1%, 16=6.2%, 32=12.5%, >=64=75.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.2%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.8%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=113MiB/s (118MB/s), 113MiB/s-113MiB/s (118MB/s-118MB/s), io=128GiB (137GB), run=1161208-1161208msec